OpenFOAM-7/tutorials/multiphase/multiphaseEulerFoam/mixerVessel2D/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     water
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        1000;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     oil
     {
         nu         1e-06;
         kappa      1e-06;
         Cp         4195;
         rho        500;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     mercury
     {
         nu         1.125e-07;
         kappa      1e-06;
         Cp         4195;
         rho        13529;

         diameterModel constant;
         constantCoeffs
         {
             d               1e-3;
         }
     }

     air
     {
         nu         1.48e-05;
         kappa      2.63e-2;
         Cp         1007;
         rho        1;

         diameterModel constant;
         constantCoeffs
         {
             d              3e-3;
         }
     }
);

sigmas
(
    (air water)     0.07
    (air oil)       0.07
    (air mercury)   0.07
    (water oil)     0
    (water mercury) 0
    (oil mercury)   0
);

interfaceCompression
(
    (air water)     0
    (air oil)       0
    (air mercury)   0
    (water oil)     0
    (water mercury) 0
    (oil mercury)   0
);

virtualMass
(
    (air water)     0.5
    (air oil)       0.5
    (air mercury)   0.5
    (water oil)     0.5
    (water mercury) 0.5
    (oil mercury)   0.5
);

drag
(
    (air water)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }

    (air oil)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }

    (air mercury)
    {
        type blended;

        air
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        mercury
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }

    (water oil)
    {
        type blended;

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }

    (water mercury)
    {
        type blended;

        water
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        mercury
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }

    (oil mercury)
    {
        type blended;

        oil
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        mercury
        {
            type SchillerNaumann;
            residualPhaseFraction 0;
            residualSlip 0;
        }

        residualPhaseFraction 1e-2;
        residualSlip 1e-2;
    }
);


// This is a dummy to support the Smagorinsky model
transportModel  Newtonian;
nu              [0 2 -1 0 0 0 0] 0;


// ************************************************************************* //
